-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: kbu_bot
-- ------------------------------------------------------
-- Server version	11.4.2-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `data_question_answer`
--

DROP TABLE IF EXISTS `data_question_answer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `data_question_answer` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `question` text NOT NULL,
  `answer` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `data_question_answer`
--

LOCK TABLES `data_question_answer` WRITE;
/*!40000 ALTER TABLE `data_question_answer` DISABLE KEYS */;
INSERT INTO `data_question_answer` VALUES (1,'คณะวิศวกรรมศาสตร์มีทั้งหมดกี่สาขา','คณะวิศวกรรมศาสตร์มีทั้งหมด 6 สาขาได้แก่ วิศวกรรมอุตสาหการ วิศวกรรมเครื่องกล วิศวกรรมไฟฟ้า วิศวกรรมโยธา วิศวกรรมคอมพิวเตอร์ วิศวกรรมซ่อมบำรุงอากาศยาน'),(2,'คณะวิศวกรรมศาสตร์มีสาขาอะไรบ้าง','คณะวิศวกรรมศาสตร์มีทั้งหมด 6 สาขาได้แก่ วิศวกรรมอุตสาหการ วิศวกรรมเครื่องกล วิศวกรรมไฟฟ้า วิศวกรรมโยธา วิศวกรรมคอมพิวเตอร์ วิศวกรรมซ่อมบำรุงอากาศยาน'),(3,'เรียนวิศวกรรมศาสตร์ค่าเทอมเท่าไหร่','ค่าเทอมของคณะวิศวกรรมศาสต์แต่ล่ะสาขาจะไม่เท่ากัน แต่โดยประมาณแล้วจะอยู่ที่ 35,000 บาท'),(4,'ค่าเทอมวิศวกรรมคอมพิวเตอร์เท่าไหร่','ค่าเทอมของวิศวกรรมคอมพิวเตอร์จะอยู่ที่ 35,000 บาท'),(5,'ค่าเทอมวิศวกรรมไฟฟ้าเท่าไหร่','ค่าเทอมของวิศวกรรมไฟฟ้าจะอยู่ที่ 35,000 บาท'),(6,'ค่าเทอมวิศวกรรมอุตสาหการเท่าไหร่','ค่าเทอมของวิศวกรรมอุตสาหการจะอยู่ที่ 35,000 บาท'),(7,'ค่าเทอมวิศวกรรมเครื่องกลเท่าไหร่','ค่าเทอมของวิศวกรรมเครื่องกลจะอยู่ที่ 35,000 บาท'),(8,'ค่าเทอมวิศวกรรมโยธาเท่าไหร่','ค่าเทอมของวิศวกรรมโยธาจะอยู่ที่ 35,000 บาท'),(9,'ค่าเทอมวิศวกรรมซ่อมบำรุงอากาศยานเท่าไหร่','ค่าเทอมของวิศวกรรมซ่อมบำรุงอากาศยานจะอยู่ที่ 35,000 บาท'),(10,'คณะวิศวะกรรมศาสตร์ต้องเรียนกี่หน่วยกิต','คณะวิศวะกรรมศาสตร์แต่ละสาขาหน่วยกิตจะไม่เท่ากัน โดยหน่วยกิตที่แต่ล่ะสาขาต้องเรียนเฉลี่ยอยู่ที่ 120 หน่วยกิต'),(11,'วิศวะกรรมคอมพิวเตอร์ต้องเรียนกี่หน่วยกิต','สำหรับหน่วยกิตของวิศวะกรรมคอมพิวเตอร์จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต  2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(12,'วิศวกรรมไฟฟ้าต้องเรียนกี่หน่วยกิตถึงจะจบ','สำหรับหน่วยกิตของวิศวะกรรมไฟฟ้า จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต  2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(13,'วิศวกรรมอุตสาหการต้องเรียนกี่หน่วยกิตถึงจะจบ','สำหรับหน่วยกิตของวิศวะกรรมอุตสาหการ จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต 2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(14,'วิศวกรรมเครื่องกลต้องเรียนกี่หน่วยกิตถึงจะจบ','สำหรับหน่วยกิตของวิศวะกรรมเครื่องกล จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต 2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(15,'วิศวกรรมโยธาต้องเรียนกี่หน่วยกิตถึงจะจบ','สำหรับหน่วยกิตของวิศวะกรรมโยธา จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต 2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(16,'วิศวกรรมซ่อมบำรุงอากาศยานต้องเรียนกี่หน่วยกิตถึงจะจบ','สำหรับหน่วยกิตของวิศวะกรรมซ่อมบำรุงอากาศยาน จะแบ่งเป็น 2 หลักสูตร 1.หลักสูตรปริญญาตรี 4 ปี 120 หน่วยกิต 2. หลักสูตรปริญญาตรีต่อเนื่อง 3 ปี 80 หน่วยกิต'),(17,'วิศวะกรรมศาสตร์เรียนวิชาอะไรบ้าง','วิชาที่คณะวิศวะกรรมศาสตร์ต้องเรียนจะแบ่งออกเป็น 3 ส่วนหลักๆ ได้แก่ 1. วิชาพื้นฐานวิศวกรรม เช่น แคลคูลัส, ฟิสิกส์, เขียนแบบ 2. วิชาบังคับซึ่งเป็นวิชาของสาขาที่จำเป็นต้องเรียน 3. วิชาเลือกเสรีสามารถเลือกเรียนได้ที่เกี่ยวข้องกับสาขาที่เรียน'),(18,'สามารถดูตารางเรียนได้ที่ไหน','สามารถดูตารางเรียนได้ที่เว็บไซต์ kbu.reg หรือแอปพลิเคชัน KBU SMART'),(19,'ห้องเรียนของคณะวิศวกรรมศาสตร์อยู่ที่ไหนบ้าง','สำหรับห้องเรียนหรือตึกเรียนของคณะวิศวกรรมศาสตร์จะเรียนอยู่ด้วยกัน 2 ตึก ได้แก่ ตึก2 และตึก4 ซึ่งในการตารางเรียนจะมีการระบุตึกที่เรียนและเลขห้องเรียนเอาไว้'),(20,'อาจารย์ที่ปรึกษาของคณะวิศวกรรมศาสตร์มีกี่คน','สำหรับอาจารย์ที่ปรึกษาของคณะวิศวกรรมมีทั้งหมด 6 คน'),(21,'หัวหน้าสาขาของวิศวกรรมคอมพิวเตอร์คือใคร','หัวหน้าสาขาของวิศวกรรมคอมพิวเตอร์คือ อาจารย์สุวิทย์ วงศ์คุ้มสิน'),(22,'หัวหน้าสาขาของวิศวกรรมไฟฟ้าคือใคร','หัวหน้าสาขาของวิศวกรรมไฟฟ้าคือ'),(23,'หัวหน้าสาขาของวิศวกรรมอุตสาหการคือใคร','หัวหน้าสาขาของวิศวกรรมอุตสาหการคือ'),(24,'หัวหน้าสาขาของวิศวกรรมเครื่องกลคือใคร','หัวหน้าสาขาของวิศวกรรมเครื่องกลคือ'),(25,'หัวหน้าสาขาของวิศวกรรมโยธาคือใคร','หัวหน้าสาขาของวิศวกรรมโยธาคือ'),(26,'หัวหน้าสาขาของวิศวกรรมซ่อมบำรุงอากาศยานคือใคร','หัวหน้าสาขาของวิศวกรรมซ่อมบำรุงอากาศยานคือ'),(27,'โรงอาหารอยู่ที่ไหน','โรงอาหารจะอยู่ที่ตึก 3 ชั้น 1'),(28,'มหาวิทยาลัยมีศูนย์ช่วยเหลือนักศึกษาไหม','ศูนย์ช่วยเหลือนักศึกษาจะอยู่ที่ตึก2 ชั้น1 ห้อง SASC'),(29,'กิจกรรมของคณะวิศวะกรรมศาสตร์มีอะไรบ้าง','คณะวิศวกรรมศาสตร์จะมีใบทรานสคริปเป็นใบกิจกรรมที่ต้องจะต้องเข้าร่วม เพื่อใช้เป็นหลักฐานในการอนุมัติส่งตัวนักศึกษาออกฝึกประสบการณ์หรือออกสหกิจ'),(30,'คณะวิศวกรรมศาสตร์ต้องมีเกรดเฉลี่ยเท่าไหร่ถึงจะจบการศึกษาได้','เกรดเฉลี่ยของคณะวิศวกรรมศาสตร์ที่จะจบการศึกษาได้อยู่ที่ 2.00 ขึ้นไป'),(31,'ทุนการศึกษาของคณะวิศวกรรมศาสตร์มีอะไรบ้าง','ทุนการศึกษาของคณะวิศวกรรมศาสตร์มีอยู่หลากหลายทุนการศึกษา เช่น ทุนเพชรวิศวกรรมศาสตร์ ทุนสโมสรนักศึกษา ซึ่งจะได้ส่วนลดค่าเทอมตามทุนการศึกษาที่ได้และยังมีทุนการศึกษาอื่นๆที่ไม่ได้กล่าวอีกด้วย'),(32,'เรียนวิศวกรรมคอมพิวเตอร์จบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น วิศวกรคอมพิวเตอร์ นักวิชาการคอมพิวเตอร์ ผู้ดูแลและออกแบบระบบโครงข่าย'),(33,'เรียนวิศวกรรมไฟฟ้าจบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น วิศวกรไฟฟ้ากำลัง วิศวกรโทรคมนาคม วิศวกรอิเล็กทรอนิกส์'),(34,'เรียนวิศวกรรมอุตสาหการจบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น วิศวกรควบคุมอัตโนมัติ วิศวกรรมออโตเมชั่น วิศวกรเครื่องมือวัด'),(35,'เรียนวิศวกรรมเครื่องกลจบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น วิศวกรออกแบบ วิศวกรตรวจสอบ วิศวกรซ่อมบำรุง วิศวกรการผลิต'),(36,'เรียนวิศวกรรมโยธาจบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น วิศวกรที่ปรึกษาวิศวกรประมาณราคา วิศวกรควบคุมงานก่อสร้าง วิศวกรสำรวจ'),(37,'เรียนวิศวกรรมซ่อมบำรุงอากาศยานจบมาทำงานอะไรได้บ้าง','สายอาชีพที่ตรงกับการเรียนในสาขานี้ เช่น ช่างซ่อมบำรุงอากาศยาน พนักงานวางแผนการซ่อมบำรุงอากาศยาน พนักงานวางแผนการบิน'),(38,'เรียนวิศวกรรมศาสตร์สาขาอะไรดี','วิศวกรรมศาสตร์ทุกสาขามีจุดเด่นและเนื้อหาการเรียนที่แตกต่างกันไป ดังนั้นที่กำลังตัดสินใจเลือกสาขาเรียนจึงควรพิจารณาจากความชื่นชอบ ความถนัด ความต้องการในการศึกษา เป้าหมายอาชีพในอนาคต เพื่อให้สามารถศึกษาจนจบได้อย่างมีความสุข'),(39,'มหาวิทยาลัยมีหอพักนักศึกษาไหม','มหาวิทยาลัยมีบริการหอพักให้กับนักศึกษาที่ต้องการจะพักอาศัยอยู่ในมหาวิทยาลัย'),(40,'หอพักนักศึกษาอยู่ที่ไหน','หอพักนักศึกษาจะอยู่หลังมหาวิยาลัยถัดจากสนามฟุตบอล'),(41,'ค่าหอพักนักศึกษาเท่าไหร่','หอพักนักศึกษาจะแบ่งออกเป็น 2 ราคา คือ 1,000 บาท และ 2,000 บาท ราคาขึ้นอยู่กับจำนวนผู้อาศัยในห้อง'),(42,'หอพักนักศึกษามีห้องแบบไหนบ้าง','หอพักนักศึกษาจะมีห้องอยู่ 2 แบบ ได้แก่ ห้องแอร์กับห้องพัดลม'),(43,'หอพักนักศึกษามีกี่ตึก','หอพักนักศึกษามีทั้งหมด 5 ตึก ได้แก่ ตึก A B C D และ E'),(44,'หอพักนักศึกษาเป็นหอรวมหรือแยก','หอพักนักศึกษาเป็นหอแยกชาย หญิง'),(45,'หอพักนักศึกษามีสิ่งอำนวยความสะดวกไหม','มีร้านสะดวกซื้อและศูนย์อาหารใต้ตึก');
/*!40000 ALTER TABLE `data_question_answer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'kbu_bot'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-10-09 22:43:12
